{
  "lastUpdated": "2022-07-23T07:03:09.567Z",
  "data": [
    {
      "id": "Ally",
      "name": "Ally",
      "nameJP": {
        "unicode": "アリィ",
        "latin": "Arī"
      },
      "gender": "Female",
      "alias": [
        "Hero",
        "愛莉",
        "아리"
      ],
      "description": "Ally is a self-proclaimed adventurer from a world that was not of other Puyo Puyo locations including Primp Town or Pwurp Island. She believes that everything can be solved by using the power of love. Her pet phrase is \"Let's fall in Love!\" .",
      "firstAppear": "Puyo Puyo Chronicle",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Amitie",
      "name": "Amitie",
      "nameJP": {
        "unicode": "アミティ",
        "latin": "Amitī"
      },
      "gender": "Female",
      "alias": [
        "亞米緹",
        "아미티"
      ],
      "description": "Amitie is a cheerful, female citizen of Primp Town. She hopes to someday become a \"wonderful magic user.\" She appears to be naive, as she is often immature, and sometimes does not understand simple jokes or puns. Amitie is the main protagonist of the second course in Puyo Puyo Fever, and is generally accepted as the main protagonist in the Fever series",
      "birthday": "May 5",
      "bloodType": "O",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Arle_Nadja",
      "name": "Arle Nadja",
      "nameJP": {
        "unicode": "アルル・ナジャ",
        "latin": "Aruru Naja"
      },
      "gender": "Female",
      "alias": [
        "Silvana",
        "Arly",
        "亞魯魯",
        "아르르"
      ],
      "description": "Arle Nadja is a young girl with magical powers. Her birthday is July 22nd. Being the main protagonist in Madou Monogatari, she is also the main protagonist of the early Puyo Puyo games, and is generally accepted to be the main protagonist of Puyo Puyo in general. She is described to be cheerful, but prone to making snarky comments. In the Madou Monogatari series, she is as young as four, but in the Puyo Puyo series, she is around 16. She attacks with elemental magic such as Fire, Ice Storm, and Thunder, but also knows some other magic such as Diacute, Heaven Ray and her signature Bayoen. Despite her design changing through out the series, Arle states that she wears the same clothes 365 days a year. Her favorite color is blue. She has a pet, or creature friend named Carbuncle or its nickname, Carby. She is desired by Satan.",
      "birthday": "July 22",
      "bloodType": "AB",
      "age": 16,
      "height": 158,
      "weight": 53,
      "firstAppear": "Disc Station #7, Madou Monogatari 123",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Dark_Arle",
      "name": "Dark Arle",
      "nameJP": {
        "unicode": "ダークアルル",
        "latin": "Da-ku Aruru"
      },
      "gender": "unknown",
      "alias": [],
      "description": "Dark Arle is the main antagonist in Puyo Puyo 7. She is actually Ecolo possessing the real Arle's body, as Ecolo isn't made up of any substances.",
      "firstAppear": "Puyo Puyo 7",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Carbuncle",
      "name": "Carbuncle",
      "nameJP": {
        "unicode": "カーバンクル",
        "latin": "Kābankuru"
      },
      "gender": "Presumed male",
      "alias": [
        "Carby",
        "Carbunny",
        "カーくん",
        "カーバンクルちゃん",
        "Has Bean",
        "Cosmo",
        "卡邦可",
        "카방클",
        "Karfunkel"
      ],
      "description": "Carbuncle, also known as Car-kun, Kaa-kun , Carby or Carbunny, is the unusually happy mascot of the Puyo Puyo games and Compile as a whole. It used to be the pet of Satan until Madou Monogatari 2, but has since stuck around with Arle. It has a tendency to wander off in search of adventure, thus creating many wacky situations. In classic Puyo Puyo games, it can normally be found in a box somewhere on the frame surrounding the field. It also has the strange ability to fire a laser from its forehead.",
      "height": 25,
      "firstAppear": "Madou Monogatari Episode II Carbuncle",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Doppelganger_Arle",
      "name": "Doppelganger Arle",
      "nameJP": {
        "unicode": "ドッペルゲンガーアルル",
        "latin": "Dopperugenga- Aruru"
      },
      "gender": "Female",
      "alias": [
        "Pierrot",
        "Némesis de Arle"
      ],
      "description": "Doppelganger Arle is a villainous sorceress based on series protagonist Arle Nadja. The concept is a recurring one throughout the Madou Monogatari series, but arguably the most prominent Doppelganger Arle serves as the primary antagonist of Puyo Puyo~n. Another refers to the deceased wife of Satan, Lilith.",
      "birthday": "July 22",
      "bloodType": "AB",
      "firstAppear": "Madou Monogatari I",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Ecolo",
      "name": "Ecolo",
      "nameJP": {
        "unicode": "エコロ",
        "latin": "Ekoro"
      },
      "gender": "Unknown, but uses male pronouns",
      "alias": [
        "Wanderer of Worlds",
        "艾克羅",
        "에쿄로"
      ],
      "description": "Ecolo is a mysterious dark character who first appears in Puyo Puyo 7. He is an entity known as a \"space-time traveler\" and can traverse dimensions to his liking. Due to the nature of being a space-time traveler whose existence conflicts with the laws of space-time, memories of his existence are easily forgotten by most.",
      "firstAppear": "Puyo Puyo 7",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Unusual_Ecolo",
      "name": "Unusual Ecolo",
      "nameJP": {
        "unicode": "かわったエコロ",
        "latin": "Kawatta Ekoro"
      },
      "gender": "Unknown",
      "alias": [],
      "description": "Unusual Ecolo is the human-like alternate form of Ecolo. He can be unlocked by buying Popoi's advice multiple times. He has the same dropset and power as Ecolo, but with different animations and voice clips.",
      "firstAppear": "Puyo Puyo!! 20th Anniversary",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Klug",
      "name": "Klug",
      "nameJP": {
        "unicode": "クルーク",
        "latin": "Kurūku"
      },
      "gender": "Male",
      "alias": [
        "Glasses",
        "克魯格",
        "크루크"
      ],
      "description": "Klug is a male denizen of Primp Town. He is known to be stuck up and rude, and is commonly perceived as a geek, nerd, or a \"goody two shoes\". The book he is always seen carrying is actually from the town library, and he continues to keep it through repeated renewal much to the librarian's chagrin. He idolizes Lemres, and hopes that one day his own magic will be recognized as powerful as Lemres's. His strong admiration for Lemres causes him to be on bad blood with Feli, who believes she is fated to be with Lemres.",
      "birthday": "September 29",
      "bloodType": "A",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Possessed_Klug",
      "name": "Possessed Klug",
      "nameJP": {
        "unicode": "あやしいクルーク",
        "latin": "Ayashii Kurūku"
      },
      "gender": "Male",
      "alias": [
        "Strange Klug",
        "著魔克魯格",
        "수상한 크루크",
        "Klug poseído",
        "Besessener Klug"
      ],
      "description": "Possessed Klug is an alternate form of Klug, specifically the form he took after he became possessed by the demon imprisoned within the Tome of Sealing in Puyo Puyo Fever 2. The book contained the supposed evil parts of a demon whose remains became Sig.",
      "birthday": "June 16",
      "bloodType": "A",
      "firstAppear": "Puyo Puyo Fever 2",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Popoi",
      "name": "Popoi",
      "nameJP": {
        "unicode": "ポポイ",
        "latin": "Popoi"
      },
      "gender": "Male",
      "alias": [
        "Black Popoi",
        "Popoi Maligno"
      ],
      "description": "Popoi is a black cat who is usually being held by Accord. Accord claims that he is a talking puppet.",
      "birthday": "February 22",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Raffina",
      "name": "Raffina",
      "nameJP": {
        "unicode": "ラフィーナ",
        "latin": "Rafīna"
      },
      "gender": "Female",
      "alias": [
        "Raffine",
        "Ragamuffin",
        "拉菲娜",
        "라피나"
      ],
      "description": "Raffina is a snobby girl from a wealthy and prestigious family of mages[1] and a citizen of Primp Town. She is also the rival of Amitie, although their rivalry was never established, and can be assumed to be one-sided. She is not very good at magic, but she can use her pouch as a kind of \"magic amplifier\" to convert and integrate martial arts into magical attacks. Raffina is implied to be insecure about her weak magic power, when Lemres discovers her techniques rely on her pouch.",
      "birthday": "July 25",
      "bloodType": "A",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Rafisol",
      "name": "Rafisol",
      "nameJP": {
        "unicode": "ラフィソル",
        "latin": "Rafisoru"
      },
      "gender": "Female",
      "alias": [
        "拉菲索",
        "라피솔"
      ],
      "description": "Rafisol is a dark entity born from Ally's pendant, the Pendant of Luwa. According to Ecolo who brought the pendant from another universe, it absorbs love power from its wearer and produces an evil being. Rafisol serves as the main antagonist of Puyo Puyo Chronicle. She shares Ally's likeness, but her palette is inverted from her counterpart. She is a being of pure dark magic that does not understand her existence.",
      "firstAppear": "Puyo Puyo Chronicle",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Ringo_Ando",
      "name": "Ringo Ando",
      "nameJP": {
        "unicode": "安藤りんご",
        "latin": "Andō Ringo"
      },
      "gender": "Female",
      "alias": [
        "林檎",
        "링고"
      ],
      "description": "Ringo Ando is the main protagonist of Puyo Puyo 7 and the main protagonist of Puyo Puyo Tetris and Puyo Puyo Tetris 2 along with a few other characters. She exists in yet another different universe to Arle and Amitie, and is taught how to play Puyo by Arle when her school is flooded with Puyo. Ringo is more down-to-earth than Arle and Amitie, is quite an intellectual person, but her curiosity does make her question many things, including, but not limited to the quirks of the game of Puyo Puyo. She is not above being weird herself, being known to spontaneously sing in the moment with improvised lyrics. She resides in the town of Suzuran and her home is located in Ando Family Fresh Produce, a family business at the town's shopping district. She is incredibly afraid of ghosts, claiming the reason is that they're \"unscientific beings.\", or simply not real. But the real reason why is because of her listening to her grandmother's ghost stories.",
      "firstAppear": "Puyo Puyo 7",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Rulue",
      "name": "Rulue",
      "nameJP": {
        "unicode": "ルルー",
        "latin": "Rurū"
      },
      "gender": "Female",
      "alias": [
        "Lulu",
        "露露",
        "루루"
      ],
      "description": "Rulue is Arle's rival and is a powerful martial artist. She's madly in love with Satan, which means she'll pretty much do anything he says. Most of those orders involve hassling Arle, which Rulue has no problem with given that she's jealous of Arle's magical powers.  Her servant is a huge minotaur, despite having substantial amount of physical ability to defend herself.",
      "birthday": "February 24",
      "age": 18,
      "height": 169,
      "weight": 52,
      "firstAppear": "Madou Monogatari 123",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Satan",
      "name": "Satan",
      "nameJP": {
        "unicode": "サタン",
        "latin": "Satan"
      },
      "gender": "Male",
      "alias": [
        "Dark Prince",
        "Gatekeeper",
        "Lucifer",
        "撒旦",
        "사탄",
        "Prince des ténèbres",
        "Príncipe Oscuro",
        "Dunkler Prinz"
      ],
      "description": "Satan is often the main antagonist of the series. He's the former owner of Carbuncle and dotes on him frequently. He apparently has a liking to Hawaiian shirts. He is attracted to Arle Nadja and claims her to be his 'fiancée' and wants to be with her under the starry night sky. According to some Compile profiles, he planned to give Carbuncle to his fiance, as proof of his love. As Carbuncle is with Arle, he is constantly chasing after her.",
      "age": 100,
      "height": 188,
      "weight": 76,
      "firstAppear": "Disc Station #7, Madou Monogatari Episode 2 Carbuncle",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Masked_Satan",
      "name": "Masked Satan",
      "nameJP": {
        "unicode": "マスクドサタン",
        "latin": "Masukudo Satan"
      },
      "gender": "unknown",
      "alias": [],
      "description": "Masked Satan is an alternate ego of Satan's in Puyo Puyo Tsu.",
      "firstAppear": "Puyo Puyo Tsu",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Yellow_Satan",
      "name": "Yellow Satan",
      "nameJP": {
        "unicode": "きいろいサタン",
        "latin": "Kiiroi Satan"
      },
      "gender": "unknown",
      "alias": [],
      "description": "Yellow Satan is an alternate costume for Satan."
    },
    {
      "id": "Schezo_Wegey",
      "name": "Schezo Wegey",
      "nameJP": {
        "unicode": "シェゾ・ウィグィィ",
        "latin": "Shezo Wigwī"
      },
      "gender": "Male",
      "alias": [
        "Dark Wizard",
        "Mage",
        "Devious",
        "謝佐",
        "셰죠"
      ],
      "description": "Schezo Wegey is a dark mage who possesses ancient magic and wields the Dark Sword. He has a tendency to drop scathing remarks, as well as a tendency to utter carelessly worded comments, oftentimes with his catchphrase \"I want you!\". This oftentimes leads to others calling him a pervert or creeper, much to his chagrin. Deep within his cool and collected personality, he harbors a liking for cute animals such as Dongurigaeru. In the ancient language of Ranian, his name means \"the gorgeous man who defiles the gods\" or \"gorgeous Adonis who defies the gods\" in the English version of Puyo Puyo Tetris 2.",
      "birthday": "March 16",
      "age": 14,
      "firstAppear": "Madou Monogatari II",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Sig",
      "name": "Sig",
      "nameJP": {
        "unicode": "シグ",
        "latin": "Shigu"
      },
      "gender": "Male",
      "alias": [
        "西格",
        "시그"
      ],
      "description": "Sig is a spacey boy, first introduced in Puyo Puyo Fever 2. Although he is sometimes shown smiling, he lacks emotions through his text, and acts passively toward things, save for his great fascination with insects. His lack of emotion in his speech lead to assumptions that he has some problems emoting. According to Puyo Puyo Fever 2, he is descended from a demon but is ignorant of his origins. His left eye is red and his left hand is a large red claw, denoting his demonic heritage.",
      "birthday": "June 16",
      "bloodType": "B",
      "firstAppear": "Puyo Puyo Fever 2",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Black_Sig",
      "name": "Black Sig",
      "nameJP": {
        "unicode": "くろいシグ",
        "latin": "Kuroi Shigu"
      },
      "gender": "unknown",
      "alias": [
        "Dark Sig",
        "Sig Oscuro"
      ],
      "description": "Black Sig is an alternate costume for Sig.",
      "firstAppear": "Puyo Puyo!! 20th Anniversary",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Draco_Centauros",
      "name": "Draco Centauros",
      "nameJP": {
        "unicode": "ドラコケンタウロス",
        "latin": "Dorako Kentaurosu"
      },
      "gender": "Female",
      "alias": [
        "Draco-Centaur",
        "Dragon Woman",
        "半龍人女",
        "드라코켄타우로스"
      ],
      "description": "Draco Centauros is a human/dragon hybrid who claims to be Arle's rival. She is capable of breathing fire and also appears to be adept at hand-to-hand fighting. A recurring element of her character is an obsession with beauty contests.",
      "birthday": "August 2",
      "age": 16,
      "firstAppear": "Madou Monogatari 3",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Harpy",
      "name": "Harpy",
      "nameJP": {
        "unicode": "ハーピー",
        "latin": "Hāpī"
      },
      "gender": "Female",
      "alias": [
        "Dark Elf",
        "哈比",
        "하피"
      ],
      "description": "Harpy is a winged humanoid who likes to sing, even when she's talking. She was originally known for being completely absorbed in her singing, to the point that she ignores anyone that talks to her. Later games would instead give her a horrible singing voice.",
      "birthday": "September 13",
      "age": 14,
      "firstAppear": "Madou Monogatari 3",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Incubus",
      "name": "Incubus",
      "nameJP": {
        "unicode": "インキュバス",
        "latin": "Inkyubasu"
      },
      "gender": "Male",
      "alias": [],
      "description": "Incubus is a narcissistic demon, who thinks of himself as a ladies man yet always fails to seduce Arle. He likes to pepper his speech with a lot of English. However, most of this is love- and sexually- themed phrases.",
      "firstAppear": "Madou Monogatari",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Kikimora",
      "name": "Kikimora",
      "nameJP": {
        "unicode": "キキーモラ",
        "latin": "Kikiimora"
      },
      "gender": "Female",
      "alias": [
        "奇奇魔拉",
        "키키모라"
      ],
      "description": "Kikimora is a maid very loosely based on the mythological Kikimora. She is obsessed with cleanliness.",
      "birthday": "May 31",
      "firstAppear": "Madou Monogatari: Michikusa Ibun",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Minotauros",
      "name": "Minotauros",
      "nameJP": {
        "unicode": "ミノタウロス",
        "latin": "Minotaurosu"
      },
      "gender": "unknown",
      "alias": [
        "Minotaur",
        "Max Minotaur"
      ],
      "description": "Minotauros is Rulue's intimidating bodyguard. Though he tries to pull off an intimidating personality, in reality he's fairly sensitive and nice. He only acts aggressive for the sake of trying to impress his charge, who he secretly harbors a crush on. He is often seen carrying around an axe, which he uses as his primary weapon. He is also a rather dangerous opponent, with his most notable technique simply being titled \"Ichigeki\", meaning 'Strike'.",
      "birthday": "February 24",
      "firstAppear": "Madou Monogatari III",
      "lastAppear": "Minna de Puyo Puyo, Puyo Puyo!! Quest"
    },
    {
      "id": "Nasu_Grave",
      "name": "Nasu Grave",
      "nameJP": {
        "unicode": "ナスグレイブ",
        "latin": "Nasu Gureibu"
      },
      "gender": "Male",
      "alias": [
        "Blue Ghost"
      ],
      "description": "Nasu Grave is a bespectacled eggplant. He can't run very fast due to his stubby little legs, and thus usually bounces to get around. He has strong fear of being eaten by others, or being crushed by Zoh Daimaoh. His catchphrase, otankonasu, is often interpreted as \"fool\" or \"potato-head.\" He tends to mention his name at the end of his sentences. His name is a pun on the words \"nasu\" and \"Musgrave\".",
      "firstAppear": "Madou Monogatari 1",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Nohoho",
      "name": "Nohoho",
      "nameJP": {
        "unicode": "のほほ",
        "latin": "Nohoho"
      },
      "gender": "Male",
      "alias": [],
      "description": "Nohoho is a recurring character in the Madou Monogatari and Puyo Puyo series. He is a traveling merchant frog, trying to sell to anyone he comes across. He also smuggles curry, and is often seen eating it, even during a heated Puyo battle.\nArle often runs across him and they usually fight over something silly, such as buying an item. Nohoho always stacks Puyos at the right side, which either gets him big chains, or makes him lose quicker. His AI's playstyle was adapted by Dongurigaeru, another frog character and Nohoho's equivalent in the Puyo Puyo Fever series.",
      "firstAppear": "Madou Monogatari 123",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Panotty",
      "name": "Panotty",
      "nameJP": {
        "unicode": "パノッティ",
        "latin": "Panotti"
      },
      "gender": "Male",
      "alias": [
        "Johnny",
        "Panotti"
      ],
      "description": "Panotty is an elf-like boy that plays panpipes and wants people to listen to his music. He has a fiery temper that is set off whenever he feels that his music is not properly appreciated.",
      "birthday": "April 3",
      "age": 9,
      "firstAppear": "Madou Monogatari 3",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Ragnus_the_Brave",
      "name": "Ragnus the Brave",
      "nameJP": {
        "unicode": "勇者ラグナス",
        "latin": "Yuusha Ragunasu"
      },
      "gender": "Male",
      "alias": [
        "Lagnus Bishasi",
        "拉格納斯",
        "라그나스"
      ],
      "description": "Ragnus the Brave, also known as Lagnus Bishasi , is a \"Light Warrior\" from the world of Gaia. He wields the Reactor Blade and serves as a counterpart to Schezo Wegey and his dark magic. He is 17, but a curse causes him to revert to a ten-year-old. He regains his maturity by leveling up , but the effects seem to be only temporary. He has a strong sense of heroic justice, but to an extreme fault at times. Although he debuted in Puyo Puyo Sun, his character is greatly expanded upon between the Shin Madou Monogatari novels and Madou Monogatari , in which he plays a central role.",
      "birthday": "April 1",
      "age": 300,
      "firstAppear": "Puyo Puyo Sun",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Serilly",
      "name": "Serilly",
      "nameJP": {
        "unicode": "セリリ",
        "latin": "Seriri"
      },
      "gender": "Female",
      "alias": [
        "Uroko Sakana Bito",
        "Seriri",
        "Mermaid",
        "賽莉莉",
        "세리리"
      ],
      "description": "Serilly, romanized as Seriri before the English version of Puyo Puyo Champions, is a mermaid that lives in a lake. She is a good friend of Owlbear, and is Suketoudara's love interest, although she is oblivious to his crush on her. Additionally, she has a shy and nervous disposition, stemming from belief in a legend that states that eating the flesh of a mermaid will grant one immortality.",
      "birthday": "March 12",
      "bloodType": "AB",
      "age": 17,
      "firstAppear": "Puyo Puyo Tsu",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Skeleton_T",
      "name": "Skeleton T",
      "nameJP": {
        "unicode": "スケルトンT",
        "latin": "Sukeruton T"
      },
      "gender": "Male",
      "alias": [
        "Skeleton",
        "Skeleton-T",
        "Esqueleto T"
      ],
      "description": "Skeleton T is a skeleton who is obsessed with Japanese tea. His catchphrase is \"o-cha!\", meaning tea. Skeleton T is also known for his very weak AI; so weak, in fact, that he never takes advantage of the ability to rotate his Puyo.",
      "firstAppear": "Madou Monogatari 123",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Suketoudara",
      "name": "Suketoudara",
      "nameJP": {
        "unicode": "すけとうだら",
        "latin": "Suketōdara"
      },
      "gender": "Male",
      "alias": [
        "Alaska pollock",
        "Walleye",
        "Goby Captain",
        "介宗鱈",
        "스케토우다라"
      ],
      "description": "Suketoudara is a fish with sexy arms and legs. He always greets people with a loud \"Fiiish!\", and loves to show off his mad dancing skills. His love for singing could contribute to his huge crush on Seriri. In most Puyo Puyo games, he starts a match by immediately filling his bottom four rows.",
      "firstAppear": "Madou Monogatari 123",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Witch",
      "name": "Witch",
      "nameJP": {
        "unicode": "ウィッチ",
        "latin": "Witchi"
      },
      "gender": "Female",
      "alias": [
        "巫巫",
        "윗치",
        "Sorcière",
        "Hexe"
      ],
      "description": "Witch is a comet magician that debuted in the Madou Monogatari series. She has random moments of giggles, and can be seen as hyperactive. Witch also apparently aspires to one day attain great magical power, making her yet another rival of Arle.",
      "birthday": "October 31",
      "age": 15,
      "firstAppear": "Madou Monogatari 123",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Zoh_Daimaoh",
      "name": "Zoh Daimaoh",
      "nameJP": {
        "unicode": "ぞう大魔王",
        "latin": "Zou Daimaou"
      },
      "gender": "Male",
      "alias": [
        "Elephant Lord",
        "大象魔王 （Dàxiàng mówáng)",
        "코끼리 대마왕"
      ],
      "description": "Zoh Daimaoh is an Indian elephant who is proud of his size and thinks fairly high of himself. Although he tries to keep himself in check, his temper is dangerously short-fused, making him prone to bursting out into a fiery rage. He is unique in that he is the only character that makes the board shake when he drops Puyo . His attacks are based around the word \"Gekido\" which translates to \"Rage\", like Raging Punch and Raging Kick. He ends sentences with \"-zo\", which is a pun on \"zou\" .",
      "firstAppear": "Madou Monogatari 123",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Accord",
      "name": "Accord",
      "nameJP": {
        "unicode": "アコール先生",
        "latin": "Akōru sensei"
      },
      "gender": "Female",
      "alias": [
        "Ms. Accord",
        "亞歌老師",
        "아코르 선생님",
        "Frau Accord"
      ],
      "description": "Accord is a teacher at the Primp Town magic school. Although there is nothing particularly suspicious about Accord during the beginning of Puyo Puyo Fever, later events suggest that Accord is anything but a normal teacher. Perhaps the most confusing event occurs in Puyo Puyo Fever - when you fight against Popoi, placing into question what he is and his real relationship to Accord.",
      "birthday": "February 12",
      "bloodType": "AB",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Akuma",
      "name": "Akuma",
      "nameJP": {
        "unicode": "あくま",
        "latin": "Akuma"
      },
      "gender": "Male",
      "alias": [],
      "description": "Akuma is a demon that resembles a giant blue bear doll that serves as the librarian and curator of the Precise Museum in Primp Town. He usually ends his sentences with ma, the second half of kuma, but will say kuma kuma repeatedly when he is worked up. His voice always seems to alternate between quiet and deep and shrill and shrieking, with no middle ground between the two. This part of his personality likely inspired his dropset, which is split between a normal set for one half and large groups for the second.",
      "birthday": "January 11",
      "firstAppear": "Puyo Puyo Fever 2",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Baldanders",
      "name": "Baldanders",
      "nameJP": {
        "unicode": "バルトアンデルス",
        "latin": "Barutoanderusu"
      },
      "gender": "Male",
      "alias": [],
      "description": "Baldanders is a dog in knight's armor. Feli accidentally summoned him with one of her spells and he stuck with her ever since. Feli sometimes either addresses him as \"Baldanders\" or just simply \"Bal\". Baldanders does not like Lemres because he is afraid of Lemres hurting her in some way. His birthday is November 23rd.",
      "birthday": "November 23",
      "bloodType": "B",
      "firstAppear": "Puyo Puyo Fever 2",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Donguri_Gaeru",
      "name": "Donguri Gaeru",
      "nameJP": {
        "unicode": "どんぐりガエル",
        "latin": "Dongurigaeru"
      },
      "gender": "Male",
      "alias": [
        "Ribbitie"
      ],
      "description": "Donguri Gaeru is a frog that rolls around in an acorn top. He only says ribbit and not a whole lot else. His name translates to \"acorn frog\" which is at the same time a pun on the word \"dengurigaeri\" .",
      "birthday": "March 31",
      "bloodType": "AB",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo Chronicle"
    },
    {
      "id": "Feli",
      "name": "Feli",
      "nameJP": {
        "unicode": "フェーリ",
        "latin": "Fēri"
      },
      "gender": "Female",
      "alias": [
        "菲莉",
        "페리"
      ],
      "description": "Feli is a female student of a magic school in a town neighboring Primp Town and a visitor who visits Primp Magic School while accompanying her upperclassman Lemres in Puyo Puyo Fever 2. Feli wears dark clothes and seems to identify with Gothic Lolita culture. Feli is questionably mysterious, and is quite skilled in the occult art of divination. She is incredibly attached to Lemres, leading to a clashing relationship with Klug.",
      "birthday": "November 13",
      "bloodType": "B",
      "firstAppear": "Puyo Puyo Fever 2",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "White_Feli",
      "name": "White Feli",
      "nameJP": {
        "unicode": "しろいフェーリ",
        "latin": "Shiroi Fēri"
      },
      "gender": "unknown",
      "alias": [
        "Angelic Feli",
        "Feli Angelical"
      ],
      "description": "White Feli is an alternate costume for Feli.",
      "firstAppear": "Puyo Puyo!! 20th Anniversary",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Lemres",
      "name": "Lemres",
      "nameJP": {
        "unicode": "レムレス",
        "latin": "Remuresu"
      },
      "gender": "Male",
      "alias": [
        "Comet Warlock",
        "雷姆雷斯",
        "렘레스"
      ],
      "description": "Lemres, known as 'the Comet Warlock,' is a senior of a magic school from a neighboring town across the desert from Primp Town and a visitor who visits Primp Magic School in Puyo Puyo Fever 2. Lemres is well respected by his peers and seems to be something of a celebrity for his young prodigy status. He is admired by Klug and desired by Feli.",
      "birthday": "August 25",
      "bloodType": "A",
      "firstAppear": "Puyo Puyo Fever 2",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Lidelle",
      "name": "Lidelle",
      "nameJP": {
        "unicode": "リデル",
        "latin": "Rideru"
      },
      "gender": "Female",
      "alias": [
        "Rider",
        "Ridel",
        "Rita",
        "莉朵兒",
        "리델"
      ],
      "description": "Lidelle is a shy female student at the Primp Town magic school, with large hair-tipped elf ears, and horns which she hides by wrapping her hair into buns around them.",
      "birthday": "January 17",
      "bloodType": "B",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Maguro_Sasaki",
      "name": "Maguro Sasaki",
      "nameJP": {
        "unicode": "佐々木まぐろ",
        "latin": "Sasaki Maguro"
      },
      "gender": "Male",
      "alias": [
        "鮪魚",
        "마구로"
      ],
      "description": "Maguro Sasaki is a student at the school in Puyo Puyo 7. He lives in the Suzuran Shopping District with Ringo, as the eldest son of a fishmonger. He is Ringo's childhood friend, and frequently spends time with her in the physics clubroom, though he does not appear to be interested in conducting experiments himself. He is reportedly to be skilled at studying, cooking, and games. He constantly carries a Puyo-themed kendama, a toy similar to a yo-yo or ball-in-cup, as he is an avid gamer; the tricks he performs with this toy comprise his attack animations. He has a unique quirk of adding ★ at the end of his sentences.",
      "birthday": "January 5",
      "bloodType": "O",
      "firstAppear": "Puyo Puyo 7",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Ocean_Prince",
      "name": "Ocean Prince",
      "nameJP": {
        "unicode": "さかな王子",
        "latin": "Sakana Ōji"
      },
      "gender": "Male",
      "alias": [
        "Prince of ocean",
        "Fish Prince",
        "The Ocean Prince",
        "Prince Salde Canarl Shellbrick III",
        "魚王子",
        "물고기 왕자",
        "Príncipe Oceánico",
        "Prinz des Ozeans"
      ],
      "description": "Ocean Prince is the fish form that Prince Salde Canarl Shellbrick III takes to evade his princely responsibilities. He is able to take this form thanks to Lemres' magic as seen in Puyo Puyo Fever 2 and the 2nd drama CD. He is pursued by his butler, Otomo, who has taken a liking to the prince.",
      "birthday": "March 5",
      "bloodType": "O",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Prince_Salde_Canarl_Shellbrick_III",
      "name": "Prince Salde Canarl Shellbrick III",
      "nameJP": {
        "unicode": "サアルデ・カナール・シェルブリック3世王子",
        "latin": "Saarude Kanāru Sheruburikku San-sei Ōji"
      },
      "gender": "Male",
      "alias": [
        "Ocean Prince"
      ],
      "description": "Prince Salde Canarl Shellbrick III is the human form of Ocean Prince. His birthday is March 5th, which is the same as Ocean Prince. His first and only important appearance is in Puyo Puyo Fever 2.",
      "birthday": "March 5",
      "bloodType": "O",
      "firstAppear": "Puyo Puyo Fever 2",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Onion_Pixie",
      "name": "Onion Pixie",
      "nameJP": {
        "unicode": "おにおん",
        "latin": "Onion"
      },
      "gender": "Male",
      "alias": [
        "Onion Pixy",
        "Duende Cebolla",
        "Zwiebelelf"
      ],
      "description": "Onion Pixie is an onion-headed oni. He speaks in an unintelligible tongue featuring the word \"onion\" excessively. In Puyo Puyo Fever 2, He seems to be upset by Oniko's crush on Sig. In Puyo Puyo! 15th Anniversary, however, he has successfully won her heart, and considers himself her exclusive bodyguard. In the plot in Puyo Puyo!! 20th Anniversary reveals that he refers to himself as a \"hard-boiled tough guy\" and hates it when anyone describes him as \"cute\".",
      "birthday": "September 29",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo Chronicle"
    },
    {
      "id": "Oshare_Bones",
      "name": "Dapper Bones",
      "nameJP": {
        "unicode": "おしゃれコウベ",
        "latin": "Oshare Kōbe"
      },
      "gender": "Male",
      "alias": [
        "Oshare Bones",
        "Huesos Dandis"
      ],
      "description": "Dapper Bones , previously known as Oshare Bones, is a skeleton that is obsessed with fashion, and oftens critiques the outfits and fashion choices of those he comes across. When he was alive, he was a poet. His Japanese name is a portmanteau of oshare, which means \"fashionable\" or \"stylish\", and sharekoube, which means \"skull \".",
      "birthday": "December 24",
      "bloodType": "B (when alive)",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Rei",
      "name": "Rei",
      "nameJP": {
        "unicode": "レイくん",
        "latin": "Reikun"
      },
      "gender": "Male",
      "alias": [
        "阿靈",
        "레이군"
      ],
      "description": "Rei is the twin brother of Yu, who usually backs up what she says. He was missing in Puyo Puyo Fever, but appears in its sequel, Puyo Puyo Fever 2. Rei is the opposite of Yu; while his sister is excited and playful, he has more of a reserved, gloomy personality.",
      "birthday": "June 9",
      "bloodType": "AB",
      "firstAppear": "Puyo Puyo Fever 2",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Risukuma",
      "name": "Risukuma",
      "nameJP": {
        "unicode": "りすくませんぱい",
        "latin": "Risukuma-senpai"
      },
      "gender": "Male",
      "alias": [
        "Risu Senpai",
        "松鼠熊學長",
        "리스쿠마 선배"
      ],
      "description": "Risukuma is an older student at the school in Puyo Puyo 7 and a former science club member, now part of the physics club with Ringo and Maguro.",
      "firstAppear": "Puyo Puyo 7",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Tarutaru",
      "name": "Tartar",
      "nameJP": {
        "unicode": "タルタル",
        "latin": "Tarutaru"
      },
      "gender": "Male",
      "alias": [],
      "description": "Tartar is a large male student at the Primp Town Magic School. Despite this, he is only present in Puyo Puyo Fever and Puyo Puyo Fever 2. Ms. Accord mentions his absence in Puyo Puyo! 15th Anniversary.",
      "birthday": "July 19",
      "bloodType": "O",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Yu",
      "name": "Yu",
      "nameJP": {
        "unicode": "ユウちゃん",
        "latin": "Yūchan"
      },
      "gender": "Female",
      "alias": [
        "小幽",
        "유우쨩"
      ],
      "description": "Yu is a cheerful female ghost. From Puyo Puyo Fever 2 on, she is accompanied with her twin brother, Rei; they are collectively known as Yu-chan & Rei-kun, or simply Yu & Rei. Yu makes puns and is constantly silly. Like Harpy, Yu starts a match by lining the left and right walls with Puyo.",
      "birthday": "June 9",
      "bloodType": "AB",
      "firstAppear": "Puyo Puyo Fever",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Ai",
      "name": "Ai",
      "nameJP": {
        "unicode": "アイ",
        "latin": "Ai"
      },
      "gender": "unknown",
      "alias": [
        "I",
        "I",
        "아이"
      ],
      "description": "Ai is a character in Puyo Puyo Tetris. He is the chief engineer on the Starship Tetra. Normally a knowledgeable gentleman, he breaks into tears and a dog-like whimper when panicking.",
      "firstAppear": "Puyo Puyo Tetris",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Ess",
      "name": "Ess",
      "nameJP": {
        "unicode": "エス",
        "latin": "Esu"
      },
      "gender": "Female",
      "alias": [
        "S",
        "S",
        "에스"
      ],
      "description": "Ess is the first mate of the Starship Tetra. She is the daughter of Ex and was left in the care of Zed until Ex could return to her. She is based on the S Tetrimino.",
      "firstAppear": "Puyo Puyo Tetris",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Ex",
      "name": "Ex",
      "nameJP": {
        "unicode": "エックス",
        "latin": "Ekkusu"
      },
      "gender": "Male",
      "alias": [
        "X",
        "Keeper of Dimensions",
        "Keeper",
        "Mr. Fancy Suspenders",
        "X",
        "엑스"
      ],
      "description": "Ex is the current Keeper of Dimensions, the former Tetris King, previous captain of the S.S. Tetra, and the true father of Ess. He represents the crossover between Puyo Puyo and Tetris and serves as the true antagonist of Puyo Puyo Tetris.",
      "firstAppear": "Puyo Puyo Tetris",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Jay_%26_Elle",
      "name": "Jay & Elle",
      "nameJP": {
        "unicode": "ジェイ&エル",
        "latin": "Jei & Eru"
      },
      "gender": "Male",
      "alias": [
        "J &amp; L",
        "J &amp; L",
        "제이&amp;엘"
      ],
      "description": "Jay and Elle are crew members on the Starship Tetra. Jay is based on the J Tetrimino, and Elle is based on the L Tetrimino.",
      "firstAppear": "Puyo Puyo Tetris",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Marle",
      "name": "Marle",
      "nameJP": {
        "unicode": "マール",
        "latin": "Maaru"
      },
      "gender": "Female",
      "alias": [
        "瑪爾",
        "마르"
      ],
      "description": "Marle is a character introduced in Puyo Puyo Tetris 2. At first, she appears to be responsible for mixing the Puyo Puyo and Tetris dimensions. After Chapter 4, Marle becomes an ally of the group and reveals herself to be a partial incarnation of the Will of the Worlds and watcher of the worlds, who ensures that all battles are fun.",
      "firstAppear": "Puyo Puyo Tetris 2",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "O",
      "name": "O",
      "nameJP": {
        "unicode": "オー",
        "latin": "Ō"
      },
      "gender": "Male",
      "alias": [
        "O",
        "오"
      ],
      "description": "O is a crew member of the Tetship, being Tee's partner with the duty of reporting on the Starship Tetra's status. All he can say is \"pi\" (\"bi\" in the Japanese version), and can be seen as a Tetris equivalent to Carbuncle. He is based on the O Tetrimino.",
      "firstAppear": "Puyo Puyo Tetris",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Squares",
      "name": "Squares",
      "nameJP": {
        "unicode": "スクエアス",
        "latin": "Sukueasu"
      },
      "gender": "Male",
      "alias": [
        "Stairs",
        "史奎亞斯",
        "스퀘어스"
      ],
      "description": "Squares is the true antagonist and final boss of Puyo Puyo Tetris 2 who brainwashed Marle and had her amass power for him.\nHe was created by Marle after she felt lonely watching over the worlds on her own, and she sees him as a younger brother.",
      "firstAppear": "Puyo Puyo Tetris 2",
      "lastAppear": "Puyo Puyo!! Quest"
    },
    {
      "id": "Tee",
      "name": "Tee",
      "nameJP": {
        "unicode": "ティ",
        "latin": "Ti"
      },
      "gender": "Male",
      "alias": [
        "T",
        "T",
        "티"
      ],
      "description": "Tee is the main protagonist of Puyo Puyo Tetris and Puyo Puyo Tetris 2. He is a young man who serves as the captain of the Starship Tetra along with his partner O. He's mindful of his manners, but as a side effect he tends to be stoic towards others. He is based on the T Tetrimino.",
      "firstAppear": "Puyo Puyo Tetris",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Zed",
      "name": "Zed",
      "nameJP": {
        "unicode": "ゼット",
        "latin": "Zetto"
      },
      "gender": "unknown",
      "alias": [
        "Z",
        "제트"
      ],
      "description": "Zed is a large housekeeping robot and a crew member on the Starship Tetra. Ex created Zed to take care of his daughter Ess while he is away from her, but Ess now sees him as her actual father, calling him \"Papa.\" With his role as a parental figure, he puts high importance on good manners and a healthy lifestyle, the latter being the basis of his spells. He is based on the Z Tetrimino.",
      "firstAppear": "Puyo Puyo Tetris",
      "lastAppear": "Puyo Puyo Tetris 2"
    },
    {
      "id": "Sonic",
      "name": "Sonic the Hedgehog",
      "nameJP": {
        "unicode": "ソニック・ザ・ヘッジホッグ",
        "latin": "Sonic the Hedgehog"
      },
      "gender": "Male",
      "alias": [
        "Blue Blur",
        "索尼克",
        "소닉"
      ],
      "description": "Sonic the Hedgehog is a blue hedgehog, the main protagonist of the Sonic the Hedgehog franchise, and the mascot of Sega. He is known as the Blue Blur in his games. In Puyo Puyo Tetris 2, he is one of four DLC characters added in the first update on January 14, 2021, along with Lidelle, Ms. Accord and Ocean Prince.",
      "birthday": "June 23",
      "age": 15,
      "firstAppear": "Overall: Rad Mobile, Franchise: Sonic the Hedgehog, Puyo:  Puyo Puyo Fever",
      "lastAppear": "Franchise: Sonic Colors: Ultimate, Puyo:  Puyo Puyo Tetris 2"
    }
  ]
}